Web Service CalculationOfPremium/Request Flow Variant 1_1.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Body>
        <CalculationOfPremium xmlns="http://www.csc.com/graphtalk/aia/" xmlns:gtx="graphtalk.aia.extension">
            <Environment>
                <Profiles>
                    <String>all_user</String>
                </Profiles>
                <UserID>MTODOROV</UserID>
            </Environment>
            <FamilyStructure>single3</FamilyStructure>
            <BirthDateList>
                <BirthDate>1950-10-10</BirthDate>
            </BirthDateList>
            <State>ACT</State>
        </CalculationOfPremium>
    </soap:Body>
</soap:Envelope>